### AWS UAT App plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/5c7338fc-c284-44ae-a043-413bdb543a5d/terraform-bin show -no-color plan.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-5325ddce.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/About-5325ddce.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-d70ea114.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/ArticleLayouts-d70ea114.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-af0b0e6e.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Articles-af0b0e6e.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad66df16.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Landing-ad66df16.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-5ddb6fa0.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/PDF-5ddb6fa0.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-92288b02.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Start-92288b02.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-41022946.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/StartButtonFloat-41022946.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-b84267ff.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Terminal-b84267ff.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-b7d43fd6.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/index-b7d43fd6.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-70f69c98.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/index.es-70f69c98.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["public/shortpoet_open_graph.png"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "public/shortpoet_open_graph.png"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["public/website_landing.png"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "public/website_landing.png"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-5325ddce.js"] will be destroyed
  # (because key ["assets/About-5325ddce.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "5cbd032b29b45e1d0a6d16e96292a9fc" -> null
      - force_destroy          = true -> null
      - id                     = "assets/About-5325ddce.js" -> null
      - key                    = "assets/About-5325ddce.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/About-5325ddce.js" -> null
      - source_hash            = "5cbd032b29b45e1d0a6d16e96292a9fc" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-8e750595.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/About-8e750595.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/About-8e750595.js"
      + source_hash            = "b91b16b22149d7b1fdf12170de458725"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-90aa24fd.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/ArticleLayouts-90aa24fd.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/ArticleLayouts-90aa24fd.js"
      + source_hash            = "a41a92345009f0b9063c75a54394d080"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-d70ea114.js"] will be destroyed
  # (because key ["assets/ArticleLayouts-d70ea114.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "60f7200ac2f35057bafcea6f92ebcae1" -> null
      - force_destroy          = true -> null
      - id                     = "assets/ArticleLayouts-d70ea114.js" -> null
      - key                    = "assets/ArticleLayouts-d70ea114.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/ArticleLayouts-d70ea114.js" -> null
      - source_hash            = "60f7200ac2f35057bafcea6f92ebcae1" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-2c9615b4.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-2c9615b4.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Articles-2c9615b4.js"
      + source_hash            = "4e6c340a33a5b8cb0e04141eb4dc174a"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-af0b0e6e.js"] will be destroyed
  # (because key ["assets/Articles-af0b0e6e.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "504882fd9335a2a3e3d636628661d79a" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Articles-af0b0e6e.js" -> null
      - key                    = "assets/Articles-af0b0e6e.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Articles-af0b0e6e.js" -> null
      - source_hash            = "504882fd9335a2a3e3d636628661d79a" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-601c8faf.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-601c8faf.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-601c8faf.js"
      + source_hash            = "1e47d9adb00d0356c7e903010bffa10a"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad247451.css"] will be destroyed
  # (because key ["assets/Landing-ad247451.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "623d1343a7416bbbdbce909629e9939d" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-ad247451.css" -> null
      - key                    = "assets/Landing-ad247451.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Landing-ad247451.css" -> null
      - source_hash            = "623d1343a7416bbbdbce909629e9939d" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad66df16.js"] will be destroyed
  # (because key ["assets/Landing-ad66df16.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "499bb3abadae7842e00e76ebcae1e2be" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-ad66df16.js" -> null
      - key                    = "assets/Landing-ad66df16.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Landing-ad66df16.js" -> null
      - source_hash            = "499bb3abadae7842e00e76ebcae1e2be" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-5ddb6fa0.js"] will be destroyed
  # (because key ["assets/PDF-5ddb6fa0.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "e8004ffe09d3e370a2bf94f0fdae1cf1" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-5ddb6fa0.js" -> null
      - key                    = "assets/PDF-5ddb6fa0.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/PDF-5ddb6fa0.js" -> null
      - source_hash            = "e8004ffe09d3e370a2bf94f0fdae1cf1" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-953ebf2a.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-953ebf2a.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-953ebf2a.js"
      + source_hash            = "98cfce9105b60545d6c1c5bb9224932c"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-2efee8e5.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-2efee8e5.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-2efee8e5.js"
      + source_hash            = "5d497c0d28716dde6bf3644df6665934"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-92288b02.js"] will be destroyed
  # (because key ["assets/Start-92288b02.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "99a701886613b4206d1454de9f1075a2" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Start-92288b02.js" -> null
      - key                    = "assets/Start-92288b02.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Start-92288b02.js" -> null
      - source_hash            = "99a701886613b4206d1454de9f1075a2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-ad247451.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-ad247451.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-ad247451.css"
      + source_hash            = "623d1343a7416bbbdbce909629e9939d"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-41022946.js"] will be destroyed
  # (because key ["assets/StartButtonFloat-41022946.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "b3918b00cf6df8bf63acfab5536d284f" -> null
      - force_destroy          = true -> null
      - id                     = "assets/StartButtonFloat-41022946.js" -> null
      - key                    = "assets/StartButtonFloat-41022946.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/StartButtonFloat-41022946.js" -> null
      - source_hash            = "b3918b00cf6df8bf63acfab5536d284f" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-f2d2b586.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartButtonFloat-f2d2b586.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/StartButtonFloat-f2d2b586.js"
      + source_hash            = "bd6edc52193e40fa4c29d18b591bb89d"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-9ebfa08f.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Terminal-9ebfa08f.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Terminal-9ebfa08f.js"
      + source_hash            = "9596ba706c3b0d7a3e002bb6b13afa3b"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-b84267ff.js"] will be destroyed
  # (because key ["assets/Terminal-b84267ff.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "767c45f65711e58cf52349c4b7a7809d" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Terminal-b84267ff.js" -> null
      - key                    = "assets/Terminal-b84267ff.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Terminal-b84267ff.js" -> null
      - source_hash            = "767c45f65711e58cf52349c4b7a7809d" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-b7d43fd6.js"] will be destroyed
  # (because key ["assets/index-b7d43fd6.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "e81f9a76dc589c96abc2896bce6fd70c" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index-b7d43fd6.js" -> null
      - key                    = "assets/index-b7d43fd6.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index-b7d43fd6.js" -> null
      - source_hash            = "e81f9a76dc589c96abc2896bce6fd70c" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-c0b8624b.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index-c0b8624b.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index-c0b8624b.js"
      + source_hash            = "70c46f2a266b208efd2da38f7a5aa47c"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-4c8c98d6.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index.es-4c8c98d6.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index.es-4c8c98d6.js"
      + source_hash            = "91b4a425c79d65a847fc14127b4c605b"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-70f69c98.js"] will be destroyed
  # (because key ["assets/index.es-70f69c98.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "b9e6cea64ca620c2cc6d52465f32d3c4" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index.es-70f69c98.js" -> null
      - key                    = "assets/index.es-70f69c98.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index.es-70f69c98.js" -> null
      - source_hash            = "b9e6cea64ca620c2cc6d52465f32d3c4" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "index.html"
      ~ source_hash            = "9094f0cb7e9ab095295e9ae4e938f836" -> "b803edcde72044b25c393636f53517ec"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

Plan: 11 to add, 1 to change, 11 to destroy.

Changes to Outputs:
  ~ s3_bucket_object_etags       = [
      - "5cbd032b29b45e1d0a6d16e96292a9fc",
      - "60f7200ac2f35057bafcea6f92ebcae1",
      - "504882fd9335a2a3e3d636628661d79a",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "d254e9f4850a323e5ea30df3ac31964d",
      - "623d1343a7416bbbdbce909629e9939d",
      - "499bb3abadae7842e00e76ebcae1e2be",
      + (known after apply),
        "e24945a32789e1abf50be49be251389e",
      - "e8004ffe09d3e370a2bf94f0fdae1cf1",
      - "99a701886613b4206d1454de9f1075a2",
      - "b3918b00cf6df8bf63acfab5536d284f",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "fff573f20a9b2c51b01a41b063cbf6bd",
      + (known after apply),
        "85561bf1ef41088b8c3f0f50a6a1fa81",
      - "767c45f65711e58cf52349c4b7a7809d",
      + (known after apply),
        "e60911495dba8bb96def57539a94e9cf",
        # (13 unchanged elements hidden)
        "056b4c93c0fc46fc6fee5d5c316171b9",
      - "e81f9a76dc589c96abc2896bce6fd70c",
      - "b9e6cea64ca620c2cc6d52465f32d3c4",
      + (known after apply),
      + (known after apply),
        "3af47f89e61fe763b909c1fabc4c4083",
        # (10 unchanged elements hidden)
    ]
  ~ s3_bucket_object_ids         = [
      - "assets/About-5325ddce.js",
      - "assets/ArticleLayouts-d70ea114.js",
      - "assets/Articles-af0b0e6e.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/Articles-cdca7afd.css",
      - "assets/Landing-ad247451.css",
      - "assets/Landing-ad66df16.js",
      + (known after apply),
        "assets/PDF-19838165.css",
      - "assets/PDF-5ddb6fa0.js",
      - "assets/Start-92288b02.js",
      - "assets/StartButtonFloat-41022946.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/StartButtonFloat-7308c767.css",
      + (known after apply),
        "assets/Terminal-2e2ec67e.css",
      - "assets/Terminal-b84267ff.js",
      + (known after apply),
        "assets/azure_devicon_forest_green-ee780a3a.svg",
        # (13 unchanged elements hidden)
        "assets/index-9a0f5c31.css",
      - "assets/index-b7d43fd6.js",
      - "assets/index.es-70f69c98.js",
      + (known after apply),
      + (known after apply),
        "assets/powershell_devicon_forest_green-f06a1fda.svg",
        # (10 unchanged elements hidden)
    ]
  ~ s3_bucket_object_keys_ids    = [
      ~ {
          ~ id  = "assets/About-5325ddce.js" -> (known after apply)
          ~ key = "assets/About-5325ddce.js" -> "assets/About-8e750595.js"
        },
      ~ {
          ~ id  = "assets/ArticleLayouts-d70ea114.js" -> (known after apply)
          ~ key = "assets/ArticleLayouts-d70ea114.js" -> "assets/ArticleLayouts-90aa24fd.js"
        },
      ~ {
          ~ id  = "assets/Articles-af0b0e6e.js" -> (known after apply)
          ~ key = "assets/Articles-af0b0e6e.js" -> "assets/Articles-2c9615b4.js"
        },
        {
            id  = "assets/Articles-cdca7afd.css"
            key = "assets/Articles-cdca7afd.css"
        },
      ~ {
          ~ id  = "assets/Landing-ad247451.css" -> (known after apply)
          ~ key = "assets/Landing-ad247451.css" -> "assets/Landing-601c8faf.js"
        },
      - {
          - id  = "assets/Landing-ad66df16.js"
          - key = "assets/Landing-ad66df16.js"
        },
        {
            id  = "assets/PDF-19838165.css"
            key = "assets/PDF-19838165.css"
        },
      ~ {
          ~ id  = "assets/PDF-5ddb6fa0.js" -> (known after apply)
          ~ key = "assets/PDF-5ddb6fa0.js" -> "assets/PDF-953ebf2a.js"
        },
      ~ {
          ~ id  = "assets/Start-92288b02.js" -> (known after apply)
          ~ key = "assets/Start-92288b02.js" -> "assets/Start-2efee8e5.js"
        },
      ~ {
          ~ id  = "assets/StartButtonFloat-41022946.js" -> (known after apply)
          ~ key = "assets/StartButtonFloat-41022946.js" -> "assets/Start-ad247451.css"
        },
        {
            id  = "assets/StartButtonFloat-7308c767.css"
            key = "assets/StartButtonFloat-7308c767.css"
        },
      + {
          + id  = (known after apply)
          + key = "assets/StartButtonFloat-f2d2b586.js"
        },
        {
            id  = "assets/Terminal-2e2ec67e.css"
            key = "assets/Terminal-2e2ec67e.css"
        },
      ~ {
          ~ id  = "assets/Terminal-b84267ff.js" -> (known after apply)
          ~ key = "assets/Terminal-b84267ff.js" -> "assets/Terminal-9ebfa08f.js"
        },
        {
            id  = "assets/azure_devicon_forest_green-ee780a3a.svg"
            key = "assets/azure_devicon_forest_green-ee780a3a.svg"
        },
        # (13 unchanged elements hidden)
        {
            id  = "assets/index-9a0f5c31.css"
            key = "assets/index-9a0f5c31.css"
        },
      ~ {
          ~ id  = "assets/index-b7d43fd6.js" -> (known after apply)
          ~ key = "assets/index-b7d43fd6.js" -> "assets/index-c0b8624b.js"
        },
      ~ {
          ~ id  = "assets/index.es-70f69c98.js" -> (known after apply)
          ~ key = "assets/index.es-70f69c98.js" -> "assets/index.es-4c8c98d6.js"
        },
        {
            id  = "assets/powershell_devicon_forest_green-f06a1fda.svg"
            key = "assets/powershell_devicon_forest_green-f06a1fda.svg"
        },
        # (10 unchanged elements hidden)
    ]
  ~ s3_bucket_object_version_ids = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
        "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
        "",
      + (known after apply),
        "",
        # (13 unchanged elements hidden)
        "",
      + (known after apply),
      + (known after apply),
        "",
        # (6 unchanged elements hidden)
        "",
      + (known after apply),
        "",
        "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-5325ddce.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/About-5325ddce.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-d70ea114.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/ArticleLayouts-d70ea114.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-af0b0e6e.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Articles-af0b0e6e.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad66df16.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Landing-ad66df16.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-5ddb6fa0.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/PDF-5ddb6fa0.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-92288b02.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Start-92288b02.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-41022946.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/StartButtonFloat-41022946.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-b84267ff.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Terminal-b84267ff.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-b7d43fd6.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/index-b7d43fd6.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-70f69c98.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/index.es-70f69c98.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["public/shortpoet_open_graph.png"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "public/shortpoet_open_graph.png"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["public/website_landing.png"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "public/website_landing.png"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-5325ddce.js"] will be destroyed%0A  # (because key ["assets/About-5325ddce.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "5cbd032b29b45e1d0a6d16e96292a9fc" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/About-5325ddce.js" -> null%0A      - key                    = "assets/About-5325ddce.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/About-5325ddce.js" -> null%0A      - source_hash            = "5cbd032b29b45e1d0a6d16e96292a9fc" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-8e750595.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/About-8e750595.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/About-8e750595.js"%0A      + source_hash            = "b91b16b22149d7b1fdf12170de458725"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-90aa24fd.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/ArticleLayouts-90aa24fd.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/ArticleLayouts-90aa24fd.js"%0A      + source_hash            = "a41a92345009f0b9063c75a54394d080"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-d70ea114.js"] will be destroyed%0A  # (because key ["assets/ArticleLayouts-d70ea114.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "60f7200ac2f35057bafcea6f92ebcae1" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/ArticleLayouts-d70ea114.js" -> null%0A      - key                    = "assets/ArticleLayouts-d70ea114.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/ArticleLayouts-d70ea114.js" -> null%0A      - source_hash            = "60f7200ac2f35057bafcea6f92ebcae1" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-2c9615b4.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Articles-2c9615b4.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Articles-2c9615b4.js"%0A      + source_hash            = "4e6c340a33a5b8cb0e04141eb4dc174a"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-af0b0e6e.js"] will be destroyed%0A  # (because key ["assets/Articles-af0b0e6e.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "504882fd9335a2a3e3d636628661d79a" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Articles-af0b0e6e.js" -> null%0A      - key                    = "assets/Articles-af0b0e6e.js" -> null%0A      - metadata
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*